app/Models/company_table_model.php

SELECT COUNT(*) AS `numrows`
FROM `companydetail`
---
    public function countAllBlogs()
    {
        return $this->builder('companydetail')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `companydetail`
---
    public function countFilteredBlogs($search, $start_date = null, $end_date = null)
    {
        $builder = $this->builder('companydetail');

        // Add search conditions
        if (!empty($search)) {
            $builder->like('company_name', $search)
                    ->orLike('company_type', $search)
                    ->orLike('company_email', $search);
        }

        // Add date filter if provided
        if (!empty($start_date) && !empty($end_date)) {
            $builder->where('date >=', $start_date)
                    ->where('date <=', $end_date);
        }

        // Return the count of filtered results
        return $builder->countAllResults();