app/Models/login_model.php

    public function insert_blog($blogdata,$filename ){
        $blogdata = [
            'image' => $filename ,
            'name' => $blogdata["name"] ,
            'date' => $blogdata["date"] ,
            'email' => $blogdata["email"],
            'number' => $blogdata["number"],
            'title' => $blogdata["title"] ,
            'gender' => $blogdata["gender"] ,
            'description' => $blogdata["description"],
            'user_id' => $blogdata["user_id"],
            'category_for' => $blogdata["category_for"],


        ];
        // print_r($blogdata);die;

        $insert = $this->db->table('blog')->insert($blogdata);
---
INSERT INTO `blog` (`name`, `user_id`, `date`, `email`, `number`, `title`, `gender`, `description`) VALUES ('mansha', '1', '2024-11-20', 'mansha12@gmail', '9144758290', ' f fvffvfvfvfv', 'on', 'vfvfvfvfvfvfv')

    public function update_news_data( $data ){
        $id = $data["id"];
        // print_r($id);die;
        $db      = \Config\Database::connect();
        $model= $db->table('news ');
        $check =   $model->where('id', $id )->set(['name'=>$data['name'],'title'=>$data['title'],'Date'=>$data['date'],'email'=>$data['email'],
      'Number'=>$data['number'],'Description'=>$data['description'],'Gender'=>$data['gender'],'category_for'=>$data['category_for']])->update();
---
UPDATE `news` SET `name` = 'rajavv', `title` = 'this is tiele', `Date` = '2024-11-12', `email` = 'rajav12@gmail.com', `Number` = '6376646300', `Description` = 'wxwxwwxwx', `Gender` = 'male', `category_for` = 'Health'
WHERE `id` = '1'

    public function save_json_output($data){
        $id = $data["id"];
        // print_r($id);die;
        $db      = \Config\Database::connect();
        $model= $db->table('menu');
        $check =   $model->where('id', $id )->set(['json_output'=>$data['jsonoutput']])->update();
---
UPDATE `menu` SET `json_output` = '[{\"text\":\"menu\",\"href\":\"localhost:8080/userblogs\",\"icon\":\"fas fa-home\",\"target\":\"_top\",\"title\":\"menu\"},{\"text\":\"blogs\",\"href\":\"localhost:8080/userblogs\",\"icon\":\"fas fa-home\",\"target\":\"_top\",\"title\":\"Userblogs\"},{\"text\":\"company setting\",\"href\":\"http://localhost:8080/companysection\",\"icon\":\"fas fa-bell\",\"target\":\"_self\",\"title\":\"company setting\"},{\"text\":\"news\",\"href\":\"http://localhost:8080/newstable\",\"icon\":\"fas fa-crop\",\"target\":\"_self\",\"title\":\"news\"},{\"text\":\"pages\",\"href\":\"http://localhost:8080/pagetable\",\"icon\":\"fas fa-flask\",\"target\":\"_self\",\"title\":\"pages\"},{\"text\":\"user\",\"href\":\"http://localhost:8080/usersection\",\"icon\":\"fas fa-home\",\"target\":\"_top\",\"title\":\"user\"},{\"text\":\"Add\",\"href\":\"\",\"icon\":\"fas fa-search\",\"target\":\"_self\",\"title\":\"\",\"children\":[{\"text\":\"default\",\"href\":\"\",\"icon\":\"fas fa-plug\",\"target\":\"_self\",\"title\":\"\",\"children\":[{\"text\":\"Opcion7-1-1\",\"href\":\"\",\"icon\":\"fas fa-filter\",\"target\":\"_self\",\"title\":\"\"}]}]}]'
WHERE `id` = '17'

    public function update_education_news($data){
        $id = $data["id"];
        // print_r($data);die;
        $db      = \Config\Database::connect();
        $model= $db->table('news');
        $check =  $model->where('id', $id )->set(['name'=>$data['name'],'title'=>$data['title'],'Date'=>$data['date'],'email'=>$data['email'],
        'Number'=>$data['number'],'Description'=>$data['description'],'Gender'=>$data['gender'],"category_for"=>$data['category_for']])->update();
---
UPDATE `news` SET `name` = 'varun', `title` = 'efrrfr', `Date` = '2024-11-14', `email` = 'sahil5475@gmail.com', `Number` = '2665456954', `Description` = 'frrfrfr', `Gender` = 'female', `category_for` = 'Education'
WHERE `id` = '8'