app/Models/page_data_table_model.php

    public function countAllBlogs()
    {
        return $this->builder('pages')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pages`

    public function countFilteredBlogs($search, $start_date = null, $end_date = null)
    {
        $builder = $this->builder('pages');

        // Add search conditions
        if (!empty($search)) {
            $builder->like('title', $search)
                    ->orLike('Number', $search)
                    ->orLike('email', $search);
        }

        // Add date filter if provided
        if (!empty($start_date) && !empty($end_date)) {
            $builder->where('date >=', $start_date)
                    ->where('date <=', $end_date);
        }

        // Return the count of filtered results
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pages`